In [ ]:
import pandas as pd
import numpy as np

In [ ]:
# 1. Crear arreglo con los datos de las mascotas
mascotas = np.array([['Bella', 'Labrador', 'Cafe', 56, 24, '2013-07-01'],
                     ['Charlie', 'Poodle', 'Negro', 43, 24, '2016-09-16'], 
                     ['Lucy', 'Chow chow', 'Cafe', 46, 24, '2014-08-25'],
                     ['Cooper', 'Schnauzer', 'Gris', 49, 17, '2011-12-11'],
                     ['Bernie', 'San Bernardo', 'Blanco', 77, 74, '2018-02-27']])

mascotas

array([['Bella', 'Labrador', 'Cafe', '56', '24', '2013-07-01'],
       ['Charlie', 'Poodle', 'Negro', '43', '24', '2016-09-16'],
       ['Lucy', 'Chow chow', 'Cafe', '46', '24', '2014-08-25'],
       ['Cooper', 'Schnauzer', 'Gris', '49', '17', '2011-12-11'],
       ['Bernie', 'San Bernardo', 'Blanco', '77', '74', '2018-02-27']],
      dtype='<U21')

In [ ]:
# 2. Crear dataframe <df>
df = pd.DataFrame(data=mascotas, columns=['Nombre', 'Raza', 'Color', 'Altura_cm', 'Peso_kg', 'Fecha_Nac'])
df

    Nombre          Raza   Color Altura_cm Peso_kg   Fecha_Nac
0    Bella      Labrador    Cafe        56      24  2013-07-01
1  Charlie        Poodle   Negro        43      24  2016-09-16
2     Lucy     Chow chow    Cafe        46      24  2014-08-25
3   Cooper     Schnauzer    Gris        49      17  2011-12-11
4   Bernie  San Bernardo  Blanco        77      74  2018-02-27

In [ ]:
# 3. Hacer otro df con datos de perros cuya fecha de nacimiento sea previa a 01 ene 2025
df2 = df[df['Fecha_Nac'] < '2015-01-01']
df2

   Nombre       Raza Color Altura_cm Peso_kg   Fecha_Nac
0   Bella   Labrador  Cafe        56      24  2013-07-01
2    Lucy  Chow chow  Cafe        46      24  2014-08-25
3  Cooper  Schnauzer  Gris        49      17  2011-12-11

In [ ]:
# 4. Cambiar el formato de caracter a numero
df['Altura_cm'] = df['Altura_cm'].astype(int)
df['Peso_kg'] = df['Peso_kg'].astype(int)

In [ ]:
# 5. Filtrar los perros cuya altura sea mayor a 50
df[df['Altura_cm'] > 50]

   Nombre          Raza   Color  Altura_cm Peso_kg   Fecha_Nac
0   Bella      Labrador    Cafe         56      24  2013-07-01
4  Bernie  San Bernardo  Blanco         77      74  2018-02-27

In [ ]:
# 6. Agregar columna de IMM (peso/altura)*2
df['IMM'] = df['Peso_kg'] / (df['Altura_cm'] / 100) ** 2
df

    Nombre          Raza   Color  Altura_cm  Peso_kg   Fecha_Nac         IMM
0    Bella      Labrador    Cafe         56       24  2013-07-01   76.530612
1  Charlie        Poodle   Negro         43       24  2016-09-16  129.799892
2     Lucy     Chow chow    Cafe         46       24  2014-08-25  113.421550
3   Cooper     Schnauzer    Gris         49       17  2011-12-11   70.803832
4   Bernie  San Bernardo  Blanco         77       74  2018-02-27  124.810255

In [ ]:
# 7. Hacer otro df con datos de IMM ordenados
df3 = df[['Nombre', 'Raza', 'IMM']]
df3 = df3.sort_values('IMM', ascending=True)
df3

    Nombre          Raza         IMM
3   Cooper     Schnauzer   70.803832
0    Bella      Labrador   76.530612
2     Lucy     Chow chow  113.421550
4   Bernie  San Bernardo  124.810255
1  Charlie        Poodle  129.799892

In [ ]:
# 8. Crear arreglo con los datos adicionales de las mascotas
mascotas = np.array([['Bella', 'Labrador', 'Cafe', 56, 24, '2013-07-01'],
                     ['Charlie', 'Poodle', 'Negro', 43, 24, '2016-09-16'], 
                     ['Lucy', 'Chow chow', 'Cafe', 46, 24, '2014-08-25'],
                     ['Cooper', 'Schnauzer', 'Gris', 49, 17, '2011-12-11'],
                     ['Bernie', 'San Bernardo', 'Blanco', 77, 74, '2018-02-27'],
                     ['Max', 'Chow chow', 'Blanco', 45, 28, '2019-03-27'],
                     ['Red', 'Schnauzer', 'Negro', 45, 15, '2017-09-18']])
mascotas

array([['Bella', 'Labrador', 'Cafe', '56', '24', '2013-07-01'],
       ['Charlie', 'Poodle', 'Negro', '43', '24', '2016-09-16'],
       ['Lucy', 'Chow chow', 'Cafe', '46', '24', '2014-08-25'],
       ['Cooper', 'Schnauzer', 'Gris', '49', '17', '2011-12-11'],
       ['Bernie', 'San Bernardo', 'Blanco', '77', '74', '2018-02-27'],
       ['Max', 'Chow chow', 'Blanco', '45', '28', '2019-03-27'],
       ['Red', 'Schnauzer', 'Negro', '45', '15', '2017-09-18']],
      dtype='<U21')

In [ ]:
# 9. Crear dataframe y modificar tipo de datos de las columnas Peso y Altura
df = pd.DataFrame(data=mascotas, columns=['Nombre', 'Raza', 'Color', 'Altura_cm', 'Peso_kg', 'Fecha_Nac'])
df['Peso_kg'] = df['Peso_kg'].astype(int)
df['Altura_cm'] = df['Altura_cm'].astype(int)
df

    Nombre          Raza   Color  Altura_cm  Peso_kg   Fecha_Nac
0    Bella      Labrador    Cafe         56       24  2013-07-01
1  Charlie        Poodle   Negro         43       24  2016-09-16
2     Lucy     Chow chow    Cafe         46       24  2014-08-25
3   Cooper     Schnauzer    Gris         49       17  2011-12-11
4   Bernie  San Bernardo  Blanco         77       74  2018-02-27
5      Max     Chow chow  Blanco         45       28  2019-03-27
6      Red     Schnauzer   Negro         45       15  2017-09-18

In [ ]:
# 10. Calcular media / promedio 

df['Peso_kg'].mean()

np.float64(29.428571428571427)

In [ ]:
# 11. Obtener la fecha de nacimiento más antigua
df['Fecha_Nac'].min()

'2011-12-11'

In [11]:
df['Altura_cm'].cumsum()

0     56
1     99
2    145
3    194
4    271
5    316
6    361
Name: Altura_cm, dtype: int64

In [ ]:
# 12. Realizar conteo por raza
df['Raza'].value_counts()

Raza
Chow chow       2
Schnauzer       2
Labrador        1
Poodle          1
San Bernardo    1
Name: count, dtype: int64

In [ ]:
# 13. FUNCIONES DE AGRUPAMIENTO
# Calcular el valor promedio del peso por cada color

df.groupby('Color')['Peso_kg'].mean()

Color
Blanco    51.0
Cafe      24.0
Gris      17.0
Negro     19.5
Name: Peso_kg, dtype: float64

In [19]:
df.groupby('Color')['Peso_kg'].agg(["min", "max", "sum"])

        min  max  sum
Color
Blanco   28   74  102
Cafe     24   24   48
Gris     17   17   17
Negro    15   24   39

In [21]:
# Agrupar por color y raza en base a la media del peso

df.groupby(['Color', 'Raza'])['Peso_kg'].mean()

Color   Raza
Blanco  Chow chow       28.0
        San Bernardo    74.0
Cafe    Chow chow       24.0
        Labrador        24.0
Gris    Schnauzer       17.0
Negro   Poodle          24.0
        Schnauzer       15.0
Name: Peso_kg, dtype: float64

In [28]:
# Uso de tabla pivote

df.pivot_table(values = 'Peso_kg', index = 'Color', aggfunc = ["mean", "median"])

          mean  median
       Peso_kg Peso_kg
Color
Blanco    51.0    51.0
Cafe      24.0    24.0
Gris      17.0    17.0
Negro     19.5    19.5

In [26]:
# Obtener promedio para 2 variables
# Calcula la media por omisión

df.pivot_table(values = 'Peso_kg', index = 'Color', columns = 'Raza', fill_value = 0)

Raza    Chow chow  Labrador  Poodle  San Bernardo  Schnauzer
Color
Blanco       28.0       0.0     0.0          74.0        0.0
Cafe         24.0      24.0     0.0           0.0        0.0
Gris          0.0       0.0     0.0           0.0       17.0
Negro         0.0       0.0    24.0           0.0       15.0

In [ ]:
# Calcular promedio por columna o fila

df.pivot_table(values = 'Peso_kg', index = 'Color', columns = 'Raza', fill_value = 0, margins = True, aggfunc = "mean")

Raza    Chow chow  Labrador  Poodle  San Bernardo  Schnauzer        All
Color
Blanco       28.0       0.0     0.0          74.0        0.0  51.000000
Cafe         24.0      24.0     0.0           0.0        0.0  24.000000
Gris          0.0       0.0     0.0           0.0       17.0  17.000000
Negro         0.0       0.0    24.0           0.0       15.0  19.500000
All          26.0      24.0    24.0          74.0       16.0  29.428571

In [34]:
# Crear indices (títulos de renglón)

df.columns
df.index

df_ind = df.set_index ('Nombre')
df_ind

                 Raza   Color  Altura_cm  Peso_kg   Fecha_Nac
Nombre
Bella        Labrador    Cafe         56       24  2013-07-01
Charlie        Poodle   Negro         43       24  2016-09-16
Lucy        Chow chow    Cafe         46       24  2014-08-25
Cooper      Schnauzer    Gris         49       17  2011-12-11
Bernie   San Bernardo  Blanco         77       74  2018-02-27
Max         Chow chow  Blanco         45       28  2019-03-27
Red         Schnauzer   Negro         45       15  2017-09-18

In [ ]:
# Regresar a indice númerico
df_ind1 = df_ind.reset_index()
df_ind1

    Nombre          Raza   Color  Altura_cm  Peso_kg   Fecha_Nac
0    Bella      Labrador    Cafe         56       24  2013-07-01
1  Charlie        Poodle   Negro         43       24  2016-09-16
2     Lucy     Chow chow    Cafe         46       24  2014-08-25
3   Cooper     Schnauzer    Gris         49       17  2011-12-11
4   Bernie  San Bernardo  Blanco         77       74  2018-02-27
5      Max     Chow chow  Blanco         45       28  2019-03-27
6      Red     Schnauzer   Negro         45       15  2017-09-18

In [37]:
df_ind

                 Raza   Color  Altura_cm  Peso_kg   Fecha_Nac
Nombre
Bella        Labrador    Cafe         56       24  2013-07-01
Charlie        Poodle   Negro         43       24  2016-09-16
Lucy        Chow chow    Cafe         46       24  2014-08-25
Cooper      Schnauzer    Gris         49       17  2011-12-11
Bernie   San Bernardo  Blanco         77       74  2018-02-27
Max         Chow chow  Blanco         45       28  2019-03-27
Red         Schnauzer   Negro         45       15  2017-09-18

In [38]:
# Buscar datos en dataframe

df[df['Nombre'].isin(['Bernie'])]

   Nombre          Raza   Color  Altura_cm  Peso_kg   Fecha_Nac
4  Bernie  San Bernardo  Blanco         77       74  2018-02-27

In [39]:
# Buscar datos en dataframe con indices

df_ind = df.set_index('Nombre')
df_ind.loc[['Bernie']]

                Raza   Color  Altura_cm  Peso_kg   Fecha_Nac
Nombre
Bernie  San Bernardo  Blanco         77       74  2018-02-27

In [40]:
# Crear más de 1 índice

df_ind3 =df.set_index(['Raza', 'Color'])
df_ind3

                      Nombre  Altura_cm  Peso_kg   Fecha_Nac
Raza         Color
Labrador     Cafe      Bella         56       24  2013-07-01
Poodle       Negro   Charlie         43       24  2016-09-16
Chow chow    Cafe       Lucy         46       24  2014-08-25
Schnauzer    Gris     Cooper         49       17  2011-12-11
San Bernardo Blanco   Bernie         77       74  2018-02-27
Chow chow    Blanco      Max         45       28  2019-03-27
Schnauzer    Negro       Red         45       15  2017-09-18

In [41]:
# Hacer consultas por características

df_ind3.loc[['Schnauzer', 'Poodle']]

                  Nombre  Altura_cm  Peso_kg   Fecha_Nac
Raza      Color
Schnauzer Gris    Cooper         49       17  2011-12-11
          Negro      Red         45       15  2017-09-18
Poodle    Negro  Charlie         43       24  2016-09-16

In [42]:
# Hacer consultas por características (con tuplas)

df_ind3.loc[[('Schnauzer', 'Gris'), ('Poodle', 'Negro')]]

                  Nombre  Altura_cm  Peso_kg   Fecha_Nac
Raza      Color
Schnauzer Gris    Cooper         49       17  2011-12-11
Poodle    Negro  Charlie         43       24  2016-09-16

In [43]:
# Ordenar por índice

df_ind3.sort_index()

                      Nombre  Altura_cm  Peso_kg   Fecha_Nac
Raza         Color
Chow chow    Blanco      Max         45       28  2019-03-27
             Cafe       Lucy         46       24  2014-08-25
Labrador     Cafe      Bella         56       24  2013-07-01
Poodle       Negro   Charlie         43       24  2016-09-16
San Bernardo Blanco   Bernie         77       74  2018-02-27
Schnauzer    Gris     Cooper         49       17  2011-12-11
             Negro       Red         45       15  2017-09-18

In [44]:
# Ordenar por más de un índice

df_ind3.sort_index(level=['Color', 'Raza'], ascending = [True, False])

                      Nombre  Altura_cm  Peso_kg   Fecha_Nac
Raza         Color
San Bernardo Blanco   Bernie         77       74  2018-02-27
Chow chow    Blanco      Max         45       28  2019-03-27
Labrador     Cafe      Bella         56       24  2013-07-01
Chow chow    Cafe       Lucy         46       24  2014-08-25
Schnauzer    Gris     Cooper         49       17  2011-12-11
             Negro       Red         45       15  2017-09-18
Poodle       Negro   Charlie         43       24  2016-09-16

In [ ]:
# Cortar un dataframe
# Extraer los primeros 3 registros
df_ind[0:3]

              Raza  Color  Altura_cm  Peso_kg   Fecha_Nac
Nombre
Bella     Labrador   Cafe         56       24  2013-07-01
Charlie     Poodle  Negro         43       24  2016-09-16
Lucy     Chow chow   Cafe         46       24  2014-08-25

In [48]:
# Extraer los registros del 2 al 4
df_ind[2:5]

                Raza   Color  Altura_cm  Peso_kg   Fecha_Nac
Nombre
Lucy       Chow chow    Cafe         46       24  2014-08-25
Cooper     Schnauzer    Gris         49       17  2011-12-11
Bernie  San Bernardo  Blanco         77       74  2018-02-27

In [52]:
df_ind3 = df_ind3.sort_index(level='Raza', ascending = True)
df_ind3

                      Nombre  Altura_cm  Peso_kg   Fecha_Nac
Raza         Color
Chow chow    Blanco      Max         45       28  2019-03-27
             Cafe       Lucy         46       24  2014-08-25
Labrador     Cafe      Bella         56       24  2013-07-01
Poodle       Negro   Charlie         43       24  2016-09-16
San Bernardo Blanco   Bernie         77       74  2018-02-27
Schnauzer    Gris     Cooper         49       17  2011-12-11
             Negro       Red         45       15  2017-09-18

In [53]:
df_ind3.loc['Chow Chow':'Labrador']

                 Nombre  Altura_cm  Peso_kg   Fecha_Nac
Raza      Color
Chow chow Blanco    Max         45       28  2019-03-27
          Cafe     Lucy         46       24  2014-08-25
Labrador  Cafe    Bella         56       24  2013-07-01

In [ ]:
# Extraer con tuplas

df_ind3.loc[('Chow chow' , 'Cafe') : ('Schnauzer', 'Gris')]

                      Nombre  Altura_cm  Peso_kg   Fecha_Nac
Raza         Color
Chow chow    Cafe       Lucy         46       24  2014-08-25
Labrador     Cafe      Bella         56       24  2013-07-01
Poodle       Negro   Charlie         43       24  2016-09-16
San Bernardo Blanco   Bernie         77       74  2018-02-27
Schnauzer    Gris     Cooper         49       17  2011-12-11

In [ ]:
# Extraer columnas

df_ind4 = df_ind3.loc[:, 'Nombre' : 'Peso_kg']
df_ind4

                      Nombre  Altura_cm  Peso_kg
Raza         Color
Chow chow    Blanco      Max         45       28
             Cafe       Lucy         46       24
Labrador     Cafe      Bella         56       24
Poodle       Negro   Charlie         43       24
San Bernardo Blanco   Bernie         77       74
Schnauzer    Gris     Cooper         49       17
             Negro       Red         45       15

In [69]:
df_ind5 = df_ind3.loc[('Chow chow' , 'Cafe') : ('Schnauzer', 'Gris'), 'Nombre' : 'Peso_kg']
df_ind5

                      Nombre  Altura_cm  Peso_kg
Raza         Color
Chow chow    Cafe       Lucy         46       24
Labrador     Cafe      Bella         56       24
Poodle       Negro   Charlie         43       24
San Bernardo Blanco   Bernie         77       74
Schnauzer    Gris     Cooper         49       17

In [ ]:
# Extraer con numeración de filas y columnas

df_ind5.iloc[1:3, 0:1]

                 Nombre
Raza     Color
Labrador Cafe     Bella
Poodle   Negro  Charlie

In [ ]:
# Extraer registros mediante tabla pivote, de acuerdo a la raza

df_altura_raza_color = df.pivot_table('Altura_cm', index = 'Raza', columns = 'Color')
df_altura_raza_color

Color         Blanco  Cafe  Gris  Negro
Raza
Chow chow       45.0  46.0   NaN    NaN
Labrador         NaN  56.0   NaN    NaN
Poodle           NaN   NaN   NaN   43.0
San Bernardo    77.0   NaN   NaN    NaN
Schnauzer        NaN   NaN  49.0   45.0

In [73]:
df_altura_raza_color.loc['Labrador':'San Bernardo']

Color         Blanco  Cafe  Gris  Negro
Raza
Labrador         NaN  56.0   NaN    NaN
Poodle           NaN   NaN   NaN   43.0
San Bernardo    77.0   NaN   NaN    NaN

In [74]:
df_altura_raza_color.mean (axis = 'index')

Color
Blanco    61.0
Cafe      51.0
Gris      49.0
Negro     44.0
dtype: float64

In [75]:
df_altura_raza_color.mean (axis = 'columns')

Raza
Chow chow       45.5
Labrador        56.0
Poodle          43.0
San Bernardo    77.0
Schnauzer       47.0
dtype: float64